# Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
# - 4 -> [1, 2, 6, 24]
# - 6 -> [1, 2, 6, 24, 120, 720]
n = int(input())
p = 1
l = []
for i in range(1, n + 1):
    p = p * i
    l.append(p)
print('-', n, '->', l)